import math


def area(r):
    '''
    Возвращает площадь круга с радиусом r
    Параметры:
        r (int|float) - радиус
    Возвращаемое значение:
        math.pi * r * r - площадь
    Пример вызова:
    >>> area(4)
    50.26548245743669
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Возвращает периметр окружности с радиусом r
    Параметры:
        r (int|float) - радиус
    Возвращаемое значение:
        2 * math.pi * r - периметр
    Пример вызова:
    >>> perimeter(3)
    18.84955592153876
    '''
    return 2 * math.pi * r
