def area(a, b):
    '''
    Возвращает площадь прямоугольника со сторонами a,b
    Параметры:
        a (float) - первая сторона
        b (float) - вторая сторона
    Возвращаемое значение:
        a*b - площадь
    Пример вызова:
    >>> area(2,4)
    8
    '''
    return a * b 

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника со сторонами a,b
    Параметры:
        a (float) - первая сторона
        b (float) - вторая сторона
    Возвращаемое значение:
        (a + b)*2- периметр
    Пример вызова:
    >>> perimeter(1,4)
    10
    '''
    return (a + b)*2

def radius(a,b):
    '''
    Возвращает радиус окружности, описанной около прямоугольника со сторонами a,b
    Параметры:
        a (float) - первая сторона
        b (float) - вторая сторона
    Возвращаемое значение:
        (a**2+b**2)**(1/2)/2 - радиус
    Пример вызова:
    >>> radius(6,8)
    5
    '''
    return (a**2+b**2)**(1/2)/2
