def area(a,h):
    '''
    Возвращает площадь треугольника со стороной a и высотой к a - h
    Параметры:
        a (float) - сторона
        h (float) - высота
    Возвращаемое значение:
        a*h/2 - площадь
    Пример вызова:
    >>> area(3,2)
    3        
    '''
    return a*h/2

def perimeter(a,b,c):
    '''
    Возвращает периметр треугольника со сторонами a,b,c
    Параметры:
        a (float) - первая сторона
        b (float) - вторая сторона
        c (float) - третья сторона
    Возвращаемое значение:
        a+b+c - периметр
    Пример вызова:
    >>> perimeter(2,4,5)
    11
    '''
    return a+b+c

def radius_inscribed_circle(s, p):
    '''
    Возвращает радиус окружности, вписанной в треугольник с площадью s и полупериметром p
    Параметры:
        s (float) - площадь
        p (float) - полупериметр
    Возвращаемое значение:
        s/p - радиус
    Пример вызова:
    >>> radius_inscribed_circle(12, 3)
    4
    '''
    return s/p